In [3]:
!pip install pymysql
!pip install mysql-connector

Requirement already satisfied: pymysql in c:\users\jaimeen\appdata\local\programs\python\python313\lib\site-packages (1.1.1)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: mysql-connector in c:\users\jaimeen\appdata\local\programs\python\python313\lib\site-packages (2.2.9)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
import os
import pymysql as pm
import mysql.connector
import pandas as pd

In [7]:
import warnings
warnings.filterwarnings("ignore")

In [16]:
connection=mysql.connector.connect(host = '18.136.157.135',user='dm_user_sql',
                                  password='37z49REb$nK@nlpV!vJ', database ="datamites_sql")

In [17]:
pd.read_sql_query("show databases", connection)

             Database
0  information_schema
1       datamites_sql

In [18]:
pd.read_sql_query("show tables", connection)

  Tables_in_datamites_sql
0                 Country
1               customers
2                    dept
3                     emp
4                  orders
5                products
6                salgrade

In [19]:
pd.read_sql_query("select * from Country", connection)

  Country_name country_name_eng country_code
0  Deutschland          Germany          DEU
1       Srbija           Serbia          SRB
2     Hrvatska          Croatia          HRV
3       Polska           Poland          POL
4          USA              USA          USA

In [25]:
pd.read_sql_query("select * from Country where Country_name like 'u%'", connection)

  Country_name country_name_eng country_code
0          USA              USA          USA

In [26]:
data = pd.read_sql_query("select * from Country", connection)

In [28]:
data.to_csv('country.csv')

In [29]:
data

  Country_name country_name_eng country_code
0  Deutschland          Germany          DEU
1       Srbija           Serbia          SRB
2     Hrvatska          Croatia          HRV
3       Polska           Poland          POL
4          USA              USA          USA